package Hw3;

/**
 * Внедрить итератор из задания 2 в коллекцию, написанную в задании 3 таким образом,
 * чтобы итератор был внутренним классом и, соответственно, объектом в коллекции.
 * Написать класс Калькулятор (необобщенный), который содержит обобщенные статические методы:
 * sum(), multiply(), divide(), subtract().
 * Параметры этих методов – два числа разного типа, над которыми должна быть произведена операция.
 * Напишите обобщенный метод compareArrays(), который принимает два массива и возвращает true,
 * если они одинаковые, и false в противном случае. Массивы могут быть любого типа данных,
 * но должны иметь одинаковую длину и содержать элементы одного типа.
 * Напишите обобщенный класс Pair, который представляет собой пару значений разного типа. Класс д
 * олжен иметь методы getFirst(), getSecond() для получения значений пары, а также переопределение
 * метода toString(), возвращающее строковое представление пары.
 */
public class Main {

}
